"""
注意：元组的内容不可修改！
"""

# 定义元组
t1 = (1, "Hello", True)
t2 = ()
t3 = tuple()
print(f"t1的类型是：{type(t1)}，内容是：{t1}")
print(f"t2的类型是：{type(t2)}，内容是：{t2}")
print(f"t3的类型是：{type(t3)}，内容是：{t3}")

# 定义单个元素元组
t4 = ("Hello")
print(type(t4))
t4 = ('Hello', ) #注意：定义1个元素元组，必须带括号，否则不是元组类型
print(type(t4))

# 元组的嵌套
t5 = ((1,2,3),(4,5,6))
print(f"t5的类型是：{type(t5)}，内容是{t5}")

# 下标索引去取出内容
num = t5[1][2]
print(f"从嵌套元组中取出的数据是：{num}") # 结果：6

# 根据index(),查找特定元素的第一个匹配项
t = (1,2,3,2,4)
print(t.index(2)) # 结果：1

# 统计某个数据在元组中出现的次数
t = (1,2,3,2,4)
print(t.count(2)) # 结果：2

# 统计元组中元素的个数
t = (1,2,3,2,4)
print(len(t)) # 结果：5

#不能修改元组元素，但可以修改其中列表元素的元素
t6 = (1,2,["tom","jerry"])
print(t6)
t6[2][0] = "汤姆"
t6[2][1] = "杰瑞"
print(t6)